#include <bits/stdc++.h>
#include <ranges>
using namespace std;
#define endl "\n"
#define all(A) A.begin(), A.end()
#define dbg(A) cout<<#A<<"=="<<A<<'\n';
#define int long long
typedef long long ll;
typedef long double ld;
typedef unsigned long long ull;
typedef array<int,2>pii;
const int INF=1e9+7;
const int MAXX=2e5+10;
const int MOD=1e9+7;
const double eps=1e-6;







inline void solve() {
    
    
    
    
}







signed main() {
    ios::sync_with_stdio(0);
    cin.tie(0);
    cout.tie(0);
    
    int t=1;
    cin>>t;
    while (t--)
        solve();
    return 0;
}
// 难道我不配AC吗
//   ▄████  █    ██  ▄▄▄██▀▀▀██▓ █    ██
//  ██▒ ▀█▒ ██  ▓██▒   ▒██  ▓██▒ ██  ▓██▒
// ▒██░▄▄▄░▓██  ▒██░   ░██  ▒██▒▓██  ▒██░
// ░▓█  ██▓▓▓█  ░██░▓██▄██▓ ░██░▓▓█  ░██░
// ░▒▓███▀▒▒▒█████▓  ▓███▒  ░██░▒▒█████▓
//  ░▒   ▒ ░▒▓▒ ▒ ▒  ▒▓▒▒░  ░▓  ░▒▓▒ ▒ ▒
//   ░   ░ ░░▒░ ░ ░  ▒ ░▒░   ▒ ░░░▒░ ░ ░
//  ░   ░  ░░░ ░ ░  ░ ░ ░   ▒ ░ ░░░ ░ ░
//       ░    ░      ░   ░   ░     ░
